app/views/visitors/index.html.erb

SELECT COUNT(*) FROM "users"
---
	<div class="col-lg-12">
		<span class="users"><p><%= link_to 'Users:', users_path, :class=>"userslink" %> <%= User.count %> registered</p></span>