app/views/users/show.html.erb

 		<div class="row">
 <% @user.pets.each do |pet| %>
---
SELECT "pet_pets".* FROM "pet_pets"  WHERE "pet_pets"."pet_id" = ?  [["pet_id", 1]]