app/controllers/pets_controller.rb

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "pets" SET "updated_at" = ?, "user_id" = ? WHERE "pets"."id" = 1  [["updated_at", "2014-12-04 10:12:49.280867"], ["user_id", 2]]
UPDATE "users" SET "neocoin" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["neocoin", 3], ["updated_at", "2014-12-04 06:49:19.749872"]]
---
	def adopt
		@pet = Pet.find(params[:id])
		@pet.user_id = current_user.id
		@user = User.find(@pet.user_id)
		if @user.neocoin == nil
			@user.neocoin = 3
		else
			@user.neocoin += 3
		end
		@user.save

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pets" SET "hunger" = ?, "updated_at" = ? WHERE "pets"."id" = 1  [["hunger", 50], ["updated_at", "2014-12-04 06:27:18.071603"]]
UPDATE "users" SET "neocoin" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["neocoin", 4], ["updated_at", "2014-12-04 06:27:18.053509"]]
---
	def feed
		@pet = Pet.find(params[:id])
		@user = User.find(@pet.user_id)
		if @user.neocoin <= 0
			flash[:error] = @pet.errors.full_messages.to_sentence
		else
			@user.neocoin -= 1
			@pet.hunger += 10
		end
		@user.save

INSERT INTO "pets" ("color", "created_at", "hunger", "loyalty", "name", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["color", "white"], ["created_at", "2014-12-04 07:20:23.565549"], ["hunger", 50], ["loyalty", 50], ["name", "bish"], ["updated_at", "2014-12-04 07:20:23.565549"], ["user_id", 1]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
---
	def create
		@pet = Pet.new(pet_params)
		@pet.hunger = 50
		@pet.loyalty = 50
		@pet.user_id = current_user.id
		if @pet.save
			redirect_to user_path(User.find(@pet.user_id))

SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "pet_pets" ("color", "created_at", "name", "pet_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["color", "fjidajf"], ["created_at", "2014-12-04 10:43:30.062326"], ["name", "fdjoajf"], ["pet_id", 1], ["updated_at", "2014-12-04 10:43:30.062326"]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = ? LIMIT 1  [["id", 2]]
---
	def createpetpet
		@pet = Pet.find(params[:id])
		@pet_pet = PetPet.new(pet_pet_params)
		@pet_pet.pet_id = @pet.id
		@pet_pet.save
		redirect_to user_path(User.find(Pet.find(params[:id]).user_id))