app/controllers/users_controller.rb

  def battle
    @pet = Pet.find(params[:id])
    success_rate = Random.new.rand(1..100)
    if (success_rate <= 75) && (@pet.hunger > 0)
      @pet.hunger -= 5
      @pet.loyalty += 10
      @user = User.find(@pet.user_id)
      @user.neocoin += 1
    else
      @pet.hunger -= 5
      @pet.loyalty -= 15
    end
    @user.save
---
SELECT  "pets".* FROM "pets"  WHERE "pets"."id" = ? LIMIT 1  [["id", 2]]
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
UPDATE "pets" SET "hunger" = ?, "loyalty" = ?, "updated_at" = ? WHERE "pets"."id" = 2  [["hunger", 45], ["loyalty", 60], ["updated_at", "2014-12-04 05:28:54.547763"]]
UPDATE "users" SET "neocoin" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["neocoin", 4], ["updated_at", "2014-12-04 06:19:31.287230"]]